user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/0.org/region_buffer/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{
    trackedSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sideWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fixedMesh
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
    global
    {
        type            global;
    }
}

// ************************************************************************* //
