user-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/system/region_fluid_carrierMeshSubset/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         none;
}

gradSchemes
{
    default         none;
    curl(ARe)       leastSquares;
    curl(AIm)       leastSquares;
    grad(ARe)       Gauss linear;
    grad(AIm)       Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
    laplacian(ARe)  Gauss linear corrected;
    laplacian(AIm)  Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    interpolate(grad(ARe)) linear;
    interpolate(grad(AIm)) linear;
}


// ************************************************************************* //
